<?php
return [
    'r_version' => '20170711',  //  静态资源文件版本
    'adminEmail' => 'admin@example.com',
    'PWD_MD5' => 1,
    'PWD_PRE_SALT' => 2,
    'PWD_SUF_SALT' => 3,

    //  开价区商品ID，购买过该商品且订单为真实完成状态，则用户等级自动提升为VIP会员
    //  开启时需要添加功能：开架区的订单确认完成时自动把用户等级改为VIP会员，在checked_note中填写订单号
    'vip_goods_id' => [],
    //使用 使用或者不是的 场景数组
    'USE_UONT' =>   [402,403,405,405],
    //使用 邮箱的 数组
    'USE_EMAIL' =>  [406,407,408,409],
    //使用 便签的 数组
    'USE_NOTE' =>   [410,411,412,413,414,415,416,417],
    // 使用是否的数组
    'USE_YON' =>    [421,425,427],
    //是否发送邮件
    'SEND_EMAIL_OR_NOT'=>[
        1=>'发送邮件',
        0=>'不发送邮件'
    ],
    //是否填写备注
    'WRITE_NOTE_OR_NOT'=>[
        1=>'必须填写备注',
        0=>'无需填写备注'
    ],

    'USE_OR_NOT'=>[
        1=>'使用',
        0=>'不使用'
    ],

    'CAN_OR_NOT'=>  [
        1=>'能',0=>'不能'
    ],
    'YES_OR_NO' => [
        1=>'是',0=>'否'
    ],
    //options
    'OPTIONS' =>[
        1=>'提示用户，点击“确定”进采购车',
        2=>'提示用户，点击“取消”进采购车',
        3=>'直接进入采购车',
        4=>'不提示并停留在当前页面'
    ],
    //采购流程中id 所对应的文字信息
    'FLOW_CONTENT'=>[
        '401' => '能否开发票:',
        '402' => '是否使用积分:',
        '403' => '是否使用红包:',
        '404' => '是否使用余额:',
        '405' => '是否使用缺货处理:',
        '406' => '确认订单时:',
        '407' => '发货时:',
        '408' => '取消订单时:',
        '409' => '把订单设为无效时:',
        '410' => '设置订单为“已付款”时:',
        '411' => '设置订单为“未付款”时:',
        '412' => '设置订单为“已发货”时:',
        '413' => '设置订单为“收货确认”时:',
        '414' => '设置订单为“未发货”时:',
        '415' => '退货时:',
        '416' => '把订单设为无效时:',
        '417' => '取消订单时:',
        '418' => '发票内容:',
        '419' => '是否允许未登录用户采购:',
        '420' => '最小采购金额:',
        '421' => '是否一步采购:',
        '422' => '发票类型及税率:',
        '423' => '减库存的时机:',
        '424' => '采购车确定提示:',
        '425' => '下订单时是否给客服发邮件:',
        '426' => '采购车里显示商品方式:',
        '427' => '采购车里是否显示商品属性:',
        '428' => '服务商分成比例(%):',
        '429' => '邀请送券的活动ID',
        '430' => '邀请送券的标题文案',
        '431' => '邀请送券的摘要文案',
    ]
];
