common/models/BrandQuery.php

SELECT * FROM `o_brand` WHERE `brand_id`=1
---
    public function one($db = null)
    {
        return parent::one($db);