common/models/GoodsQuery.php

SELECT * FROM `o_goods` `goods` WHERE `goods_id` IN ('1863', '1781', '2766', '2228')
---
    public function all($db = null)
    {
        return parent::all($db);

SELECT * FROM `o_goods` WHERE `goods_id`=1
---
    public function one($db = null)
    {
        return parent::one($db);