common/models/OrderInfoQuery.php

SELECT * FROM `o_order_info` `orderInfo` WHERE `order_id`='11773'
---
    public function all($db = null)
    {
        return parent::all($db);