common/models/UsersQuery.php

SELECT * FROM `o_users` WHERE `user_id`='5109'
---
    public function one($db = null)
    {
        return parent::one($db);