api/modules/v1/controllers/AddressController.php

SELECT * FROM `o_user_address` WHERE (`user_id`='3079') AND (`address_id`=1888)
---
    public function actionEdit() {
        $userModel = Yii::$app->user->identity;
        $params = Yii::$app->request->post('data');

        if (empty($params['address_id'])) {
            Yii::error('请指定要变更的地址 address_id');
            throw new BadRequestHttpException('请指定要变更的地址', 1);
        } else {
            $model = UserAddress::find()->where([
                'user_id' => $userModel->user_id,
                'address_id' => $params['address_id']
            ])->one();