api/modules/v1/controllers/BrandController.php


        $brandDetail = $brand->getBrandDetail();
        // 品牌的商品参与的套餐列表 --start
        $giftPkgList = GiftPkg::find()->alias('giftPkg')->joinWith([
            'giftPkgGoods giftPkgGoods',
            'giftPkgGoods.goods goods',
        ])->where([
            'giftPkg.is_on_sale' => 1,
        ])->andWhere([
            'goods.brand_id' => $brand_id,
        ])->all();
---
SELECT `giftPkg`.* FROM `o_gift_pkg` `giftPkg` LEFT JOIN `o_gift_pkg_goods` `giftPkgGoods` ON `giftPkg`.`id` = `giftPkgGoods`.`gift_pkg_id` LEFT JOIN `o_goods` `goods` ON `giftPkgGoods`.`goods_id` = `goods`.`goods_id` WHERE (`giftPkg`.`is_on_sale`=1) AND (`goods`.`brand_id`='1')