api/modules/v1/controllers/UserController.php

    public function actionPurchasing_desire(){
        $token = Yii::$app->request->getAuthUser();
        $userModel = Users::find()->where(['access_token' => $token])->one();
        if (!$userModel) {
            throw new BadRequestHttpException('请登录', 1);
        }
        if(empty(Yii::$app->request->post('content'))){
            throw new BadRequestHttpException('请输入采购内容', 1);
        }
        $wish_list = new WishList();
        $wish_list->user_id = $userModel->user_id;
        $wish_list->state = 1;
        $wish_list->created_at = date('Y-m-d H:i:s');;
        $wish_list->content = Yii::$app->request->post('content');
        if($wish_list->save()){
---
INSERT INTO `o_wish_list` (`user_id`, `state`, `created_at`, `content`) VALUES (5109, 1, '2017-11-13 17:11:14', '韦德玛卸妆油')