common/helper/CacheHelper.php

    public static function setUserRankCache()
    {
        $cache_file_name = self::getCacheFileName('user_rank_map');
        $cache = '';

        $rs = UserRank::find()->asArray()->indexBy('rank_id')->all();
---
SELECT * FROM `o_user_rank`

    public static function setShopConfigParams()
    {
        $cache_file_name = self::getCacheFileName('shop_config_params');
        $cache = '';

        $rs = ShopConfig::find()
            ->asArray()
            ->indexBy('code')
            ->all();
---
SELECT * FROM `o_shop_config`

    public static function setBrandCatCache() {
        $cache_file_name = self::getCacheFileName('all_brand_cat_map');
        $cache = [];

        //  品牌-区域映射
        $area_cat_tree_root = Yii::$app->params['area_cat_tree_root'];
        $brandAreaMap = Category::find()->joinWith('children son')
            ->select(['o_category.cat_id', 'o_category.cat_name', 'o_category.sort_order', 'son.cat_desc'])
            ->where([
                'o_category.parent_id' => $area_cat_tree_root,
                'o_category.is_show' => Category::IS_SHOW,
                'son.is_show' => Category::IS_SHOW,
            ])->orderBy([
                'o_category.sort_order' => SORT_DESC
            ])->asArray()
            ->all();
---
SELECT `o_category`.`cat_id`, `o_category`.`cat_name`, `o_category`.`sort_order`, `son`.`cat_desc` FROM `o_category` LEFT JOIN `o_category` `son` ON `o_category`.`cat_id` = `son`.`parent_id` WHERE (`o_category`.`parent_id`=101) AND (`o_category`.`is_show`=1) AND (`son`.`is_show`=1) ORDER BY `o_category`.`sort_order` DESC


        //  品牌-商品分类映射
        $goods_cat_tree_root = Yii::$app->params['goods_cat_tree_root'];
        $cache['cat'] = Category::find()->select(['cat_id', 'cat_name', 'brand_list'])
            ->where(['parent_id' => $goods_cat_tree_root])
            ->orderBy(['sort_order' => SORT_DESC])
            ->asArray()
            ->all();
---
SELECT `cat_id`, `cat_name`, `brand_list` FROM `o_category` WHERE `parent_id`=299 ORDER BY `sort_order` DESC

        }

        //  热门品牌    配置在商品分类的 【品牌分类(101)】 的热门品牌    $area_cat_tree_root
        $hot_brand = Category::find()->select(['cat_id', 'brand_list'])
            ->where(['cat_id' => $area_cat_tree_root])
            ->asArray()
            ->one();
---
SELECT `cat_id`, `brand_list` FROM `o_category` WHERE `cat_id`=101

    public static function setCategoryCache()
    {
        $cache_file_name = self::getCacheFileName('category_cache');

        $categoryList = Category::find()
            ->asArray()
            ->indexBy('cat_id')
            ->orderBy(['sort_order' => SORT_DESC])->all();

        //统计SKU总数
        $query = new Query();
        $categoryGoodsCount = $query->select([
            'cat_id',
            'count(*) AS goodsCount'
        ])->from(Goods::tableName())->where([
            'is_on_sale' => 1,
            'is_delete' => 0,
        ])->indexBy('cat_id')->groupBy('cat_id')->all();
---
SELECT * FROM `o_category` ORDER BY `sort_order` DESC
SELECT `cat_id`, count(*) AS goodsCount FROM `o_goods` WHERE (`is_on_sale`=1) AND (`is_delete`=0) GROUP BY `cat_id`